Data joining in Pandas

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
student_info = pd.DataFrame({
    'student_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'name': ['John', 'Jane', 'Joe', 'Mary', 'Peter', 'Paul', 'Jill', 'Jack', 'Jen', 'Jenny'],
    'student_subject': ['Math', 'Math', 'Math', 'Math', 'Math', 'Math', 'Math', 'Math', 'Math', 'Math'],
})

In [4]:
student_results = pd.DataFrame({ 
    'student_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'student_marks': [90, 80, 70, 60, 50, 65, 75, 72, 59, 20],
    'student_result': ['Pass', 'Pass', 'Pass', 'Pass', 'Fail', 'Pass', 'Pass', 'Pass', 'Fail', 'Fail'],
})

In [5]:
student_info

   student_id   name student_subject
0           1   John            Math
1           2   Jane            Math
2           3    Joe            Math
3           4   Mary            Math
4           5  Peter            Math
5           6   Paul            Math
6           7   Jill            Math
7           8   Jack            Math
8           9    Jen            Math
9          10  Jenny            Math

In [6]:
student_results

   student_id  student_marks student_result
0           1             90           Pass
1           2             80           Pass
2           3             70           Pass
3           4             60           Pass
4           5             50           Fail
5           6             65           Pass
6           7             75           Pass
7           8             72           Pass
8           9             59           Fail
9          10             20           Fail

In [11]:
InnerJoin = student_info.merge(student_results, on='student_id', how='inner', suffixes=('_info', '_results'))
InnerJoin.head(10)

   student_id   name student_subject  student_marks student_result
0           1   John            Math             90           Pass
1           2   Jane            Math             80           Pass
2           3    Joe            Math             70           Pass
3           4   Mary            Math             60           Pass
4           5  Peter            Math             50           Fail
5           6   Paul            Math             65           Pass
6           7   Jill            Math             75           Pass
7           8   Jack            Math             72           Pass
8           9    Jen            Math             59           Fail
9          10  Jenny            Math             20           Fail

In [12]:
InnerJoin = student_info.merge(student_results, on='student_id', how='inner', suffixes=('_info', '_results'))
InnerJoin.loc[InnerJoin['student_result'] == 'Pass',['name','student_marks']]

   name  student_marks
0  John             90
1  Jane             80
2   Joe             70
3  Mary             60
5  Paul             65
6  Jill             75
7  Jack             72